ZandorTeseling/STM32F446RE_DRV8323BLDC/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2020 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f4xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include <../Inc/retarget.h>
#include <../Inc/string_process.h>
#include <../Config/user_config.h>
#include <../Config/motor_config.h>
#include <../Config/hw_config.h>
#include <../Inc/can.h>
#include <../DRV8323_RS/drv8323.h>
#include <../MA700/ma700.h>
/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

void HAL_TIM_MspPostInit(TIM_HandleTypeDef *htim);

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define TIMER_10_FqCheck_Pin GPIO_PIN_3
#define TIMER_10_FqCheck_GPIO_Port GPIOC
#define DRV8323_CS_Pin GPIO_PIN_6
#define DRV8323_CS_GPIO_Port GPIOC
#define MA700_CS_Pin GPIO_PIN_7
#define MA700_CS_GPIO_Port GPIOC
#define DRV8323_ENABLE_Pin GPIO_PIN_8
#define DRV8323_ENABLE_GPIO_Port GPIOC
#define DRV8323_HIZ_Pin GPIO_PIN_9
#define DRV8323_HIZ_GPIO_Port GPIOC
/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
